======
identifier
======

a

---

(program (identifier))

======
prefix operator
======

+a

---

(program
	(prefix_expression (operator) (identifier)))

======
implicit member
======

.x

---

(program
	(member_expression (identifier)))

======
explicit member
======

x.y

---

(program
	(member_expression (identifier) (identifier)))

======
subscript
======

x[]
x[y]
x[y, z]

---

(program
	(subscript_expression (identifier))
	(subscript_expression (identifier) (identifier))
	(subscript_expression (identifier) (identifier) (identifier)))

======
trailing closure
======

foo {}
foo { return }

---

(program
	(function_call_expression (identifier) (closure_expression))
	(function_call_expression (identifier) (closure_expression (return_statement))))
