======
identifier
======

a

---

(program (identifier))

======
prefix operator
======

+a

---

(program
	(prefix_expression (operator) (identifier)))

======
implicit member
======

.x

---

(program
	(member_expression (identifier)))

======
explicit member
======

x.y

---

(program
	(member_expression (identifier) (identifier)))

======
subscript
======

x[]
x[y]
x[y, z]

---

(program
	(subscript_expression (identifier))
	(subscript_expression (identifier) (identifier))
	(subscript_expression (identifier) (identifier) (identifier)))

======
function call
======

foo()
foo(x)
foo(x, y: z)
foo(x, y: z)()

---

(program
	(function_call_expression (identifier) (parenthesized_expression))
	(function_call_expression (identifier) (parenthesized_expression (identifier)))
	(function_call_expression (identifier) (parenthesized_expression (identifier) (pair (identifier) (identifier))))
	(function_call_expression (function_call_expression (identifier) (parenthesized_expression (identifier) (pair (identifier) (identifier)))) (parenthesized_expression)))

======
trailing closure
======

foo {}
foo() {}
foo { return }
foo() { return }

---

(program
	(function_call_expression (identifier) (closure_expression))
	(function_call_expression (identifier) (parenthesized_expression) (closure_expression))
	(function_call_expression (identifier) (closure_expression (return_statement)))
	(function_call_expression (identifier) (parenthesized_expression) (closure_expression (return_statement))))
