======
identifier
======

a

---

(program (identifier))

======
prefix operator
======

+a

---

(program
	(operator) (identifier))

======
implicit member
======

.x

---

(program
	(member_expression (identifier)))

======
explicit member
======

x.y

---

(program
	(member_expression (identifier) (identifier)))
